{
  "personalInfo": {
    "name": "Manuel Michael Retamozo Garc铆a",
    "title": {
      "es": "Desarrollador Full Stack",
      "en": "Full Stack Developer"
    },
    "greeting": {
      "es": "Hola, soy ",
      "en": "Hello, I'm "
    },
    "description": {
      "es": "Creo sitios web y aplicaciones web para diferentes industrias, enfoc谩ndome en un enfoque de dise帽o modular para construir interfaces flexibles y escalables.",
      "en": "I create websites and web applications for different industries, focusing on a modular design approach to build flexible and scalable interfaces."
    },
    "about": {
      "es": {
        "paragraph1": "Profesional Full Stack apasionado por la inform谩tica y el desarrollo web, con un enfoque y fortaleza distintivos en el frontend. Soy experto en Angular y cuento con s贸lidos conocimientos en React y Next.js, aplicados en diversos proyectos. Mi base s贸lida se asienta en HTML, CSS y JavaScript.",
        "paragraph2": "En el 谩mbito del backend, poseo experiencia con .NET. Mis competencias en bases de datos incluyen SQL Server, Oracle SQL y PL/SQL. Adem谩s, domino tecnolog铆as como C, Astro, Figma, Tailwind CSS y Angular Material, entre otras. Mi compromiso es la constante actualizaci贸n y la exploraci贸n de las 煤ltimas tendencias tecnol贸gicas, asegurando una evoluci贸n continua en el desarrollo."
      },
      "en": {
        "paragraph1": "A Full Stack professional passionate about IT and web development, with a distinct focus and strength in the frontend. I am an expert in Angular and possess solid knowledge in React and Next.js, applied across various projects. My strong foundation is built upon HTML, CSS, and JavaScript.",
        "paragraph2": "On the backend, I have experience with .NET. My database competencies include SQL Server, Oracle SQL, and PL/SQL. Furthermore, I master technologies such as C, Astro, Figma, Tailwind CSS, and Angular Material, among others. My commitment lies in continuous learning and exploring the latest technological trends, ensuring ongoing evolution in development."
      }
    },
    "sleepingMessage": {
      "es": " Probablemente est茅 durmiendo ahora, 隆pero responder茅 tan pronto como pueda!",
      "en": " I'm probably sleeping right now, but I'll reply as soon as I can!"
    },
    "location": "Madrid, Espa帽a",
    "email": "hello@mretamozo.com",
    "phone": "+34 666 666 666",
    "image": "/profile.webp"
  },
  "social": {
    "linkedin": "https://www.linkedin.com/in/mmretamozo/",
    "github": "https://github.com/snakeblack",
    "twitter": "https://x.com/michael_snake"
  },
  "experience": [
    {
      "company": "Hiberus",
      "position": {
        "es": "Desarrollador Full Stack",
        "en": "Full Stack Developer"
      },
      "period": "2025 - Actual",
      "description": {
        "es": "Como Desarrollador Fullstack en Ibercaja, implemento funcionalidades clave en un proyecto Fintech para el sector asegurador. Mi contribuci贸n se extiende a lo largo de todo el ciclo de desarrollo, construyendo sobre una arquitectura definida de microservicios con .NET 8 y microfrontends con Angular (v19+). Mi rol requiere la aplicaci贸n de tecnolog铆as avanzadas para la comunicaci贸n en tiempo real y as铆ncrona (RabbitMQ), la orquestaci贸n de m贸dulos con Module Federation y el uso de un sistema de dise帽o corporativo para proporcionar una soluci贸n escalable y de alto impacto para el negocio.",
        "en": "As a Full Stack Developer at Ibercaja, I implement key functionalities in a Fintech project for the insurance sector. My contribution spans the entire development cycle, building on a defined microservices architecture with .NET 8 and microfrontends with Angular (v19+). My role requires the application of advanced technologies for real-time and asynchronous communication (RabbitMQ), module orchestration with Module Federation, and the use of a corporate design system to provide a scalable and high-impact solution for the business."
      }
    },
    {
      "company": "Exis-TI (Indra - DGC)",
      "position": {
        "es": "Ingeniero de Software",
        "en": "Software Engineer"
      },
      "period": "2024 - 2025",
      "description": {
        "es": "En Indra, desarrollo aplicaciones Fullstack para el proyecto de Valoraciones Catastrales del Gobierno de Espa帽a, utilizando .NET, Angular, y PL/SQL. Aseguro rendimiento, seguridad y colaboro con equipos multidisciplinarios siguiendo metodolog铆as 谩giles para modernizar procesos catastrales.",
        "en": "At Indra, I develop Fullstack applications for the Spanish Government's Cadastral Valuations project, using .NET, Angular, and PL/SQL. I ensure performance, security and collaborate with multidisciplinary teams following agile methodologies to modernize cadastral processes."
      }
    },
    {
      "company": "CEF.- Centro de Estudios Financieros",
      "position": {
        "es": "Desarrollador web",
        "en": "Web Developer"
      },
      "period": "2022 - 2024",
      "description": {
        "es": "Desarrollo aplicaciones web desde cero usando Angular y .NET, con un fuerte enfoque en el frontend. Tengo amplia experiencia creando soluciones completas, desde el dise帽o inicial hasta la implementaci贸n y el lanzamiento.",
        "en": "Develop web applications from scratch using Angular and .NET, with a strong focus on frontend. I have extensive experience creating complete solutions, from initial design to implementation and launch."
      }
    },
    {
      "company": "CEF.- Centro de Estudios Financieros",
      "position": {
        "es": "T茅cnico de TI",
        "en": "IT Technician"
      },
      "period": "2021 - 2023",
      "description": {
        "es": "Experiencia en la instalaci贸n y configuraci贸n de software y hardware, ofreciendo soporte t茅cnico tanto presencial como remoto a usuarios.",
        "en": "Experience in software and hardware installation and configuration, providing both on-site and remote technical support to users."
      }
    },
    {
      "company": "La f谩brica de software",
      "position": {
        "es": "Programador",
        "en": "Programmer"
      },
      "period": "2019 - 2020",
      "description": {
        "es": "Experiencia en el desarrollo de aplicaciones de escritorio utilizando VB.NET y C#, incluyendo la creaci贸n de nuevas soluciones y el mantenimiento de las ya existentes.",
        "en": "Experience in developing desktop applications using VB.NET and C#, including creating new solutions and maintaining existing ones."
      }
    }
  ],
  "projects": [
    {
      "name": "DevTools MMRG",
      "description": {
        "es": "Optimiza tu desarrollo con DevTools MMRG: tu repositorio centralizado de herramientas de desarrollo esenciales. Cada utilidad viene con explicaciones claras generadas por IA, permiti茅ndote comprender y aplicar soluciones de manera r谩pida y efectiva, impulsando tu productividad y aprendizaje.",
        "en": "Optimize your development with DevTools MMRG: your centralized repository of essential development tools. Each utility comes with clear AI-generated explanations, allowing you to quickly understand and apply solutions effectively, boosting your productivity and learning."
      },
      "url": "https://devtools.mretamozo.com/",
      "technologies": [
        "Astro",
        "Tailwindcss",
        "API GEMINI"
      ],
      "year": "2025",
      "screenshot": "/assets/screenshots/devtools.avif"
    },
    {
      "name": "Baterias Express",
      "description": {
        "es": "Landing page para una servicio delivery de venta y reparaciones de baterias",
        "en": "Landing page for a delivery service for battery sales and repairs"
      },
      "url": "https://www.bateriascoches24horas.es/",
      "technologies": [
        "Astro",
        "Tailwindcss",
        "Vercel"
      ],
      "year": "2024",
      "screenshot": "/assets/screenshots/bateriasexpress.webp"
    },
    {
      "name": "Recambios las Margaritas",
      "description": {
        "es": "Landing page para una tienda de recambios de coches",
        "en": "Landing page for a car parts store"
      },
      "url": "https://recambioslasmargaritas.es/",
      "technologies": [
        "Astro",
        "Tailwindcss",
        "Vercel"
      ],
      "year": "2024",
      "screenshot": "/assets/screenshots/recambioslasmargaritas.webp"
    },
    {
      "name": "Blog",
      "description": {
        "es": "Blog de desarrollo web y tecnolog铆a",
        "en": "Web development and technology blog"
      },
      "url": "https://blog.mretamozo.com/",
      "technologies": [
        "Next.js",
        "Tailwindcss",
        "Mdx"
      ],
      "year": "2023",
      "screenshot": "/assets/screenshots/blog.webp"
    },
    {
      "name": "Prueba Tecnica: Reactive Forms",
      "description": {
        "es": "Prueba t茅cnica para una oferta de trabajo, consiste en un formulario reactivo con Angular",
        "en": "Technical test for a job offer, consists of a reactive form with Angular"
      },
      "url": "https://prueba-tecnica-alicunde.mretamozo.com/login",
      "technologies": [
        "Angular",
        "Clean Code",
        "Reactive Forms"
      ],
      "year": "2023",
      "screenshot": "/assets/screenshots/pruebatecnicareactiveforms.webp"
    },
    {
      "name": "Device Manager",
      "description": {
        "es": "Aplicaci贸n para gestionar dispositivos electr贸nicos, inventariado y dem谩s.",
        "en": "Application to manage electronic devices, inventory and more."
      },
      "url": "https://github.com/Snakeblack/device-manager",
      "technologies": [
        "Next.js",
        "Tailwind",
        "MySql"
      ],
      "year": "2022",
      "screenshot": "/assets/screenshots/devicemanager.webp"
    }
  ],
  "skills": [
    { "name": "HTML", "type": "technical", "category": "frontend" },
    { "name": "CSS", "type": "technical", "category": "frontend" },
    { "name": "JavaScript", "type": "technical", "category": "frontend" },
    { "name": "TypeScript", "type": "technical", "category": "frontend" },
    { "name": "Angular", "type": "technical", "category": "frontend" },
    { "name": ".NET", "type": "technical", "category": "backend" },
    { "name": "React", "type": "technical", "category": "frontend" },
    { "name": "Next.js", "type": "technical", "category": "frontend" },
    { "name": "Tailwindcss", "type": "technical", "category": "frontend" },
    { "name": "Astro", "type": "technical", "category": "frontend" },
    { "name": "Node.js", "type": "technical", "category": "backend" },
    { "name": "SQL Server", "type": "technical", "category": "database" },
    { "name": "Oracle SQL", "type": "technical", "category": "database" },
    { "name": "PL/SQL", "type": "technical", "category": "database" },
    { "name": "C#", "type": "technical", "category": "backend" },
    { "name": "C", "type": "technical", "category": "other" },
    { "name": "Java", "type": "technical", "category": "backend" },
    { "name": "Figma", "type": "technical", "category": "design" },
    { "name": "Angular Material", "type": "technical", "category": "frontend" },
    { "name": "MongoDB", "type": "technical", "category": "database" },
    { "name": "Firebase", "type": "technical", "category": "backend" },
    { "name": "Bootstrap", "type": "technical", "category": "frontend" },
    { "name": "Azure DevOps", "type": "technical", "category": "devops" },
    { "name": "GitHub", "type": "technical", "category": "devops" },
    { "name": "Git", "type": "technical", "category": "devops" },
    { "name": "Docker", "type": "technical", "category": "devops" },
    {
      "name": { "es": "Comunicaci贸n Efectiva", "en": "Effective Communication" },
      "type": "soft",
      "description": {
        "es": "Habilidad para transmitir ideas de forma clara y concisa.",
        "en": "Ability to convey ideas clearly and concisely."
      }
    },
    {
      "name": { "es": "Trabajo en Equipo", "en": "Teamwork" },
      "type": "soft",
      "description": {
        "es": "Capacidad para colaborar eficazmente con otros para alcanzar objetivos comunes.",
        "en": "Ability to collaborate effectively with others to achieve common goals."
      }
    },
    {
      "name": { "es": "Resoluci贸n de Problemas", "en": "Problem Solving" },
      "type": "soft",
      "description": {
        "es": "Aptitud para identificar problemas y encontrar soluciones efectivas.",
        "en": "Aptitude to identify problems and find effective solutions."
      }
    },
    {
      "name": { "es": "Adaptabilidad", "en": "Adaptability" },
      "type": "soft",
      "description": {
        "es": "Flexibilidad para ajustarse a nuevas situaciones y cambios.",
        "en": "Flexibility to adjust to new situations and changes."
      }
    },
    {
      "name": { "es": "Pensamiento Cr铆tico", "en": "Critical Thinking" },
      "type": "soft",
      "description": {
        "es": "Capacidad para analizar informaci贸n de manera objetiva y tomar decisiones fundamentadas.",
        "en": "Ability to analyze information objectively and make well-founded decisions."
      }
    }
  ]
}